<?php
/**
 * Created by PhpStorm.
 * User: grayVTouch
 * Date: 2019/6/20
 * Time: 10:57
 */

return [
    // 用户状态
    'user_status' => [
        // 0为封禁，1为可用，2为待验证
        0 => '禁用' ,
        1 => '正常' ,
        2 => '待验证' ,
    ] ,
    // 用户支付验证 0为未验证，1为已验证，2为待通过，3为驳回
//    'user_is_verify' => [
//        0 => '未验证' ,
//        1 => '已验证' ,
//        2 => '待通过' ,
//        3 => '驳回' ,
//    ] ,
    // 布尔
    'bool' => [
        0 => '否' ,
        1 => '是' ,
    ] ,
    // 性别
    'sex' => [
        0 => '未知' ,
        1 => '男' ,
        2 => '女' ,
        3 => '两性' ,
    ] ,
    // 用户类型
    'user_type' => [
        1 => '用户' ,
        2 => '商家' ,
    ] ,
    // 商家类型
    'merchant_type' => [
        1 => '自营店铺' ,
        2 => '合作店铺' ,
        3 => '普通店铺' ,
    ] ,
    // 商家申请审核状态
    'merchant_application_status' => [
        1 => '审核中' ,
        2 => '审核通过' ,
        3 => '审核不通过' ,
    ] ,
    // 商家状态
    // 商家状态：1-正常 2-锁定
    'merchant_status' => [
        1 => '正常' ,
        2 => '锁定' ,
    ],
    // 后台用户状态
    'admin_status' => [
        1 => '正常' ,
        2 => '锁定' ,
        3 => '禁用' ,
    ] ,

    // 游戏收益类型
    'game_profit_type' => [
        1 => '游戏收益' ,
        2 => '领导收益' ,
    ] ,

    // 游戏状态
    'game_status' => [
        0 => '结束' ,
        1 => '进行中' ,
    ] ,

    // 游戏状态
    'community_status' => [
        0 => '不开放' ,
        1 => '开放' ,
    ] ,

    // 游戏状态
    'community_slideshow_status' => [
        0 => '不使用' ,
        1 => '使用' ,
    ] ,

    // 社区资讯类型
    'community_type' => [
        1 => '新闻' ,
        2 => '应用' ,
        3 => '游戏' ,
    ] ,

    // 社区资讯类型
    'community_announce_type' => [
        // 0=通稿  1=关于我们 2=使用协议 3=隐私条款 4=游戏规则  5=游戏说明
        0 => '通稿' ,
        1 => '关于我们' ,
        2 => '使用协议' ,
        3 => '隐私条款' ,
        4 => '游戏规则' ,
        5 => '游戏说明' ,
    ] ,

    // 社区资讯类型
    'bb_order_type' => [
        1 => '卖单' ,
        2 => '买单' ,
    ] ,

    // 社区资讯类型
    'bb_order_status' => [
        0 => '交易结束' ,
        1 => '等待交易' ,
        2 => '撤单' ,
    ] ,

    //
    'user_is_verify' => [
        0 => '等待' ,
        1 => '通过' ,
        2 => '拒绝' ,
    ] ,

    // 转出
    'transfer_out_status' => [
        1 => '通过' ,
        10 => '自动通过' ,
        -1 => '拒绝' ,
        -10 => '自动拒绝' ,
        0 => '待审核' ,
    ] ,

    // 完成
    'transfer_out_complete' => [
        0 => '未操作' ,
        1 => '已操作' ,
    ] ,

    // 状态
    'approve_for_transfer_out' => [
        // -1拒绝，1通过，0等待通过
        -1 => '拒绝' ,
        1 => '通过' ,
        0 => '待审核'
    ] ,

    'shop_goods_auth' => [
        1 => '商品需要审核' ,
        2 => '商品无需审核' ,
    ] ,
];